w3ichen/haptic-hand/stm32f4xx_tim_mort.c
  /* Reset the IC1PSC Bits */
  TIMx->CCMR1 &= (uint16_t)~TIM_CCMR1_IC1PSC_MORT;

  /* Set the IC1PSC value */
  TIMx->CCMR1 |= TIM_ICPSC;
}

/**
  * @brief  Sets the TIMx Input Capture 2 prescaler.
  * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
  *         peripheral.
  * @param  TIM_ICPSC: specifies the Input Capture2 prescaler new value.
  *          This parameter can be one of the following values:
  *            @arg TIM_ICPSC_DIV1_MORT: no prescaler
  *            @arg TIM_ICPSC_DIV2_MORT: capture is done once every 2 events
  *            @arg TIM_ICPSC_DIV4_MORT: capture is done once every 4 events
  *            @arg TIM_ICPSC_DIV8_MORT: capture is done once every 8 events
  * @retval None
  */
void TIM_SetIC2Prescaler_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_ICPSC)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST2_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_IC_PRESCALER_MORT(TIM_ICPSC));

  /* Reset the IC2PSC Bits */
  TIMx->CCMR1 &= (uint16_t)~TIM_CCMR1_IC2PSC_MORT;

  /* Set the IC2PSC value */
  TIMx->CCMR1 |= (uint16_t)(TIM_ICPSC << 8);
}

/**
  * @brief  Sets the TIMx Input Capture 3 prescaler.
  * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
  * @param  TIM_ICPSC: specifies the Input Capture3 prescaler new value.
  *          This parameter can be one of the following values:
  *            @arg TIM_ICPSC_DIV1_MORT: no prescaler
  *            @arg TIM_ICPSC_DIV2_MORT: capture is done once every 2 events
  *            @arg TIM_ICPSC_DIV4_MORT: capture is done once every 4 events
  *            @arg TIM_ICPSC_DIV8_MORT: capture is done once every 8 events
  * @retval None
  */
void TIM_SetIC3Prescaler_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_ICPSC)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST3_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_IC_PRESCALER_MORT(TIM_ICPSC));

  /* Reset the IC3PSC Bits */
  TIMx->CCMR2 &= (uint16_t)~TIM_CCMR2_IC3PSC_MORT;

  /* Set the IC3PSC value */
  TIMx->CCMR2 |= TIM_ICPSC;
}

/**
  * @brief  Sets the TIMx Input Capture 4 prescaler.
  * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
  * @param  TIM_ICPSC: specifies the Input Capture4 prescaler new value.
  *          This parameter can be one of the following values:
  *            @arg TIM_ICPSC_DIV1_MORT: no prescaler
  *            @arg TIM_ICPSC_DIV2_MORT: capture is done once every 2 events
  *            @arg TIM_ICPSC_DIV4_MORT: capture is done once every 4 events
  *            @arg TIM_ICPSC_DIV8_MORT: capture is done once every 8 events
  * @retval None
  */
void TIM_SetIC4Prescaler_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_ICPSC)
{  
  /* Check the parameters */
  assert_param(IS_TIM_LIST3_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_IC_PRESCALER_MORT(TIM_ICPSC));

  /* Reset the IC4PSC Bits */
  TIMx->CCMR2 &= (uint16_t)~TIM_CCMR2_IC4PSC_MORT;

  /* Set the IC4PSC value */
  TIMx->CCMR2 |= (uint16_t)(TIM_ICPSC << 8);
}
/**
  * @}
  */

/** @defgroup TIM_Group4 Advanced-control timers (TIM1_MORT and TIM8_MORT) specific features
 *  @brief   Advanced-control timers (TIM1_MORT and TIM8_MORT) specific features
 *
@verbatim   
 ===============================================================================
      ##### Advanced-control timers (TIM1_MORT and TIM8_MORT) specific features #####
 ===============================================================================  
        
             ##### TIM Driver: how to use the Break feature #####
 ===============================================================================
    [..] 
    After configuring the Timer channel(s) in the appropriate Output Compare mode: 
                         
      (#) Fill the TIM_BDTRInitStruct with the desired parameters for the Timer
          Break Polarity, dead time, Lock level, the OSSI/OSSR State and the 
          AOE(automatic output enable).
               
      (#) Call TIM_BDTRConfig_mort(TIMx, &TIM_BDTRInitStruct) to configure the Timer
          
      (#) Enable the Main Output using TIM_CtrlPWMOutputs_mort(TIM1_MORT, ENABLE) 
          
      (#) Once the break even occurs, the Timer's output signals are put in reset
          state or in a known state (according to the configuration made in
          TIM_BDTRConfig_mort() function).

@endverbatim
  * @{
  */

/**
  * @brief  Configures the Break feature, dead time, Lock level, OSSI/OSSR State
  *         and the AOE(automatic output enable).
  * @param  TIMx: where x can be  1 or 8 to select the TIM 
  * @param  TIM_BDTRInitStruct: pointer to a TIM_BDTRInitTypeDef_mort structure that
  *         contains the BDTR Register configuration  information for the TIM peripheral.
  * @retval None
  */
void TIM_BDTRConfig_mort(TIM_TypeDef_mort* TIMx, TIM_BDTRInitTypeDef_mort *TIM_BDTRInitStruct)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST4_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_OSSR_STATE(TIM_BDTRInitStruct->TIM_OSSRState));
  assert_param(IS_TIM_OSSI_STATE(TIM_BDTRInitStruct->TIM_OSSIState));
  assert_param(IS_TIM_LOCK_LEVEL_MORT(TIM_BDTRInitStruct->TIM_LOCKLevel));
  assert_param(IS_TIM_BREAK_STATE(TIM_BDTRInitStruct->TIM_Break));
  assert_param(IS_TIM_BREAK_POLARITY_MORT(TIM_BDTRInitStruct->TIM_BreakPolarity));
  assert_param(IS_TIM_AUTOMATIC_OUTPUT_STATE_MORT(TIM_BDTRInitStruct->TIM_AutomaticOutput));

  /* Set the Lock level, the Break enable Bit and the Polarity, the OSSR State,
     the OSSI State, the dead time value and the Automatic Output Enable Bit */
  TIMx->BDTR = (uint32_t)TIM_BDTRInitStruct->TIM_OSSRState | TIM_BDTRInitStruct->TIM_OSSIState |
             TIM_BDTRInitStruct->TIM_LOCKLevel | TIM_BDTRInitStruct->TIM_DeadTime |
             TIM_BDTRInitStruct->TIM_Break | TIM_BDTRInitStruct->TIM_BreakPolarity |
             TIM_BDTRInitStruct->TIM_AutomaticOutput;
}

/**
  * @brief  Fills each TIM_BDTRInitStruct member with its default value.
  * @param  TIM_BDTRInitStruct: pointer to a TIM_BDTRInitTypeDef_mort structure which
  *         will be initialized.
  * @retval None
  */
void TIM_BDTRStructInit_mort(TIM_BDTRInitTypeDef_mort* TIM_BDTRInitStruct)
{
  /* Set the default configuration */
  TIM_BDTRInitStruct->TIM_OSSRState = TIM_OSSRState_Disable_MORT;
  TIM_BDTRInitStruct->TIM_OSSIState = TIM_OSSIState_Disable_MORT;
  TIM_BDTRInitStruct->TIM_LOCKLevel = TIM_LOCKLevel_OFF_MORT;
  TIM_BDTRInitStruct->TIM_DeadTime = 0x00;
  TIM_BDTRInitStruct->TIM_Break = TIM_Break_Disable_MORT;
  TIM_BDTRInitStruct->TIM_BreakPolarity = TIM_BreakPolarity_Low_MORT;
  TIM_BDTRInitStruct->TIM_AutomaticOutput = TIM_AutomaticOutput_Disable_MORT;
}

/**
  * @brief  Enables or disables the TIM peripheral Main Outputs.
  * @param  TIMx: where x can be 1 or 8 to select the TIMx peripheral.
  * @param  NewState: new state of the TIM peripheral Main Outputs.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TIM_CtrlPWMOutputs_mort(TIM_TypeDef_mort* TIMx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST4_PERIPH_MORT(TIMx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the TIM Main Output */
    TIMx->BDTR |= TIM_BDTR_MOE_MORT;
  }
  else
  {
    /* Disable the TIM Main Output */
    TIMx->BDTR &= (uint16_t)~TIM_BDTR_MOE_MORT;
  }  
}

/**
  * @brief  Selects the TIM peripheral Commutation event.
  * @param  TIMx: where x can be  1 or 8 to select the TIMx peripheral
  * @param  NewState: new state of the Commutation event.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TIM_SelectCOM_mort(TIM_TypeDef_mort* TIMx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST4_PERIPH_MORT(TIMx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the COM Bit */
    TIMx->CR2 |= TIM_CR2_CCUS_MORT;
  }
  else
  {
    /* Reset the COM Bit */
    TIMx->CR2 &= (uint16_t)~TIM_CR2_CCUS_MORT;
  }
}

/**
  * @brief  Sets or Resets the TIM peripheral Capture Compare Preload Control bit.
  * @param  TIMx: where x can be  1 or 8 to select the TIMx peripheral
  * @param  NewState: new state of the Capture Compare Preload Control bit
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TIM_CCPreloadControl_mort(TIM_TypeDef_mort* TIMx, FunctionalState NewState)
{ 
  /* Check the parameters */
  assert_param(IS_TIM_LIST4_PERIPH_MORT(TIMx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    /* Set the CCPC Bit */
    TIMx->CR2 |= TIM_CR2_CCPC_MORT;
  }
  else
  {
    /* Reset the CCPC Bit */
    TIMx->CR2 &= (uint16_t)~TIM_CR2_CCPC_MORT;
  }
}
/**
  * @}
  */

/** @defgroup TIM_Group5 Interrupts DMA and flags management functions
 *  @brief    Interrupts, DMA and flags management functions 
 *
@verbatim   
 ===============================================================================
          ##### Interrupts, DMA and flags management functions #####
 ===============================================================================  

@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the specified TIM interrupts.
  * @param  TIMx: where x can be 1 to 14 to select the TIMx peripheral.
  * @param  TIM_IT: specifies the TIM interrupts sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg TIM_IT_Update_MORT: TIM update Interrupt source
  *            @arg TIM_IT_CC1_MORT: TIM Capture Compare 1 Interrupt source
  *            @arg TIM_IT_CC2_MORT: TIM Capture Compare 2 Interrupt source
  *            @arg TIM_IT_CC3_MORT: TIM Capture Compare 3 Interrupt source
  *            @arg TIM_IT_CC4_MORT: TIM Capture Compare 4 Interrupt source
  *            @arg TIM_IT_COM_MORT: TIM Commutation Interrupt source
  *            @arg TIM_IT_Trigger_MORT: TIM Trigger Interrupt source
  *            @arg TIM_IT_Break_MORT: TIM Break Interrupt source
  *  
  * @note   For TIM6_MORT and TIM7_MORT only the parameter TIM_IT_Update_MORT can be used
  * @note   For TIM9_MORT and TIM12_MORT only one of the following parameters can be used: TIM_IT_Update_MORT,
  *          TIM_IT_CC1_MORT, TIM_IT_CC2_MORT or TIM_IT_Trigger_MORT. 
  * @note   For TIM10_MORT, TIM11_MORT, TIM13_MORT and TIM14_MORT only one of the following parameters can
  *          be used: TIM_IT_Update_MORT or TIM_IT_CC1_MORT   
  * @note   TIM_IT_COM_MORT and TIM_IT_Break_MORT can be used only with TIM1_MORT and TIM8_MORT 
  *        
  * @param  NewState: new state of the TIM interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TIM_ITConfig_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_IT, FunctionalState NewState)
{  
  /* Check the parameters */
  assert_param(IS_TIM_ALL_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_IT_MORT(TIM_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the Interrupt sources */
    TIMx->DIER |= TIM_IT;
  }
  else
  {
    /* Disable the Interrupt sources */
    TIMx->DIER &= (uint16_t)~TIM_IT;
  }
}

/**
  * @brief  Configures the TIMx event to be generate by software.
  * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
  * @param  TIM_EventSource: specifies the event source.
  *          This parameter can be one or more of the following values:	   
  *            @arg TIM_EventSource_Update_MORT: Timer update Event source
  *            @arg TIM_EventSource_CC1_MORT: Timer Capture Compare 1 Event source
  *            @arg TIM_EventSource_CC2_MORT: Timer Capture Compare 2 Event source
  *            @arg TIM_EventSource_CC3_MORT: Timer Capture Compare 3 Event source
  *            @arg TIM_EventSource_CC4_MORT: Timer Capture Compare 4 Event source
  *            @arg TIM_EventSource_COM_MORT: Timer COM event source  
  *            @arg TIM_EventSource_Trigger_MORT: Timer Trigger Event source
  *            @arg TIM_EventSource_Break_MORT: Timer Break event source
  * 
  * @note   TIM6_MORT and TIM7_MORT can only generate an update event. 
  * @note   TIM_EventSource_COM_MORT and TIM_EventSource_Break_MORT are used only with TIM1_MORT and TIM8_MORT.
  *        
  * @retval None
  */
void TIM_GenerateEvent_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_EventSource)
{ 
  /* Check the parameters */
  assert_param(IS_TIM_ALL_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_EVENT_SOURCE_MORT(TIM_EventSource));
 
  /* Set the event sources */
  TIMx->EGR = TIM_EventSource;
}

/**
  * @brief  Checks whether the specified TIM flag is set or not.
  * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
  * @param  TIM_FLAG: specifies the flag to check.
  *          This parameter can be one of the following values:
  *            @arg TIM_FLAG_Update_MORT: TIM update Flag
  *            @arg TIM_FLAG_CC1_MORT: TIM Capture Compare 1 Flag
  *            @arg TIM_FLAG_CC2_MORT: TIM Capture Compare 2 Flag
  *            @arg TIM_FLAG_CC3_MORT: TIM Capture Compare 3 Flag
  *            @arg TIM_FLAG_CC4_MORT: TIM Capture Compare 4 Flag
  *            @arg TIM_FLAG_COM_MORT: TIM Commutation Flag
  *            @arg TIM_FLAG_Trigger_MORT: TIM Trigger Flag
  *            @arg TIM_FLAG_Break_MORT: TIM Break Flag
  *            @arg TIM_FLAG_CC1OF_MORT: TIM Capture Compare 1 over capture Flag
  *            @arg TIM_FLAG_CC2OF_MORT: TIM Capture Compare 2 over capture Flag
  *            @arg TIM_FLAG_CC3OF_MORT: TIM Capture Compare 3 over capture Flag
  *            @arg TIM_FLAG_CC4OF_MORT: TIM Capture Compare 4 over capture Flag
  *
  * @note   TIM6_MORT and TIM7_MORT can have only one update flag. 
  * @note   TIM_FLAG_COM_MORT and TIM_FLAG_Break_MORT are used only with TIM1_MORT and TIM8_MORT.    
  *
  * @retval The new state of TIM_FLAG (SET or RESET).
  */
FlagStatus TIM_GetFlagStatus_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_FLAG)
{ 
  ITStatus bitstatus = RESET;  
  /* Check the parameters */
  assert_param(IS_TIM_ALL_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_GET_FLAG(TIM_FLAG));

  
  if ((TIMx->SR & TIM_FLAG) != (uint16_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Clears the TIMx's pending flags.
  * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
  * @param  TIM_FLAG: specifies the flag bit to clear.
  *          This parameter can be any combination of the following values:
  *            @arg TIM_FLAG_Update_MORT: TIM update Flag
  *            @arg TIM_FLAG_CC1_MORT: TIM Capture Compare 1 Flag
  *            @arg TIM_FLAG_CC2_MORT: TIM Capture Compare 2 Flag
  *            @arg TIM_FLAG_CC3_MORT: TIM Capture Compare 3 Flag
  *            @arg TIM_FLAG_CC4_MORT: TIM Capture Compare 4 Flag
  *            @arg TIM_FLAG_COM_MORT: TIM Commutation Flag
  *            @arg TIM_FLAG_Trigger_MORT: TIM Trigger Flag
  *            @arg TIM_FLAG_Break_MORT: TIM Break Flag
  *            @arg TIM_FLAG_CC1OF_MORT: TIM Capture Compare 1 over capture Flag
  *            @arg TIM_FLAG_CC2OF_MORT: TIM Capture Compare 2 over capture Flag
  *            @arg TIM_FLAG_CC3OF_MORT: TIM Capture Compare 3 over capture Flag
  *            @arg TIM_FLAG_CC4OF_MORT: TIM Capture Compare 4 over capture Flag
  *
  * @note   TIM6_MORT and TIM7_MORT can have only one update flag. 
  * @note   TIM_FLAG_COM_MORT and TIM_FLAG_Break_MORT are used only with TIM1_MORT and TIM8_MORT.
  *    
  * @retval None
  */
void TIM_ClearFlag_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_FLAG)
{  
  /* Check the parameters */
  assert_param(IS_TIM_ALL_PERIPH_MORT(TIMx));
   
  /* Clear the flags */
  TIMx->SR = (uint16_t)~TIM_FLAG;
}

/**
  * @brief  Checks whether the TIM interrupt has occurred or not.
  * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
  * @param  TIM_IT: specifies the TIM interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg TIM_IT_Update_MORT: TIM update Interrupt source
  *            @arg TIM_IT_CC1_MORT: TIM Capture Compare 1 Interrupt source
  *            @arg TIM_IT_CC2_MORT: TIM Capture Compare 2 Interrupt source
  *            @arg TIM_IT_CC3_MORT: TIM Capture Compare 3 Interrupt source
  *            @arg TIM_IT_CC4_MORT: TIM Capture Compare 4 Interrupt source
  *            @arg TIM_IT_COM_MORT: TIM Commutation Interrupt source
  *            @arg TIM_IT_Trigger_MORT: TIM Trigger Interrupt source
  *            @arg TIM_IT_Break_MORT: TIM Break Interrupt source
  *
  * @note   TIM6_MORT and TIM7_MORT can generate only an update interrupt.
  * @note   TIM_IT_COM_MORT and TIM_IT_Break_MORT are used only with TIM1_MORT and TIM8_MORT.
  *     
  * @retval The new state of the TIM_IT(SET or RESET).
  */
ITStatus TIM_GetITStatus_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_IT)
{
  ITStatus bitstatus = RESET;  
  uint16_t itstatus = 0x0, itenable = 0x0;
  /* Check the parameters */
  assert_param(IS_TIM_ALL_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_GET_IT_MORT(TIM_IT));
   
