w3ichen/haptic-hand/stm32f4xx_tim_mort.c
  itstatus = TIMx->SR & TIM_IT;
  
  itenable = TIMx->DIER & TIM_IT;
  if ((itstatus != (uint16_t)RESET) && (itenable != (uint16_t)RESET))
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Clears the TIMx's interrupt pending bits.
  * @param  TIMx: where x can be 1 to 14 to select the TIM peripheral.
  * @param  TIM_IT: specifies the pending bit to clear.
  *          This parameter can be any combination of the following values:
  *            @arg TIM_IT_Update_MORT: TIM1_MORT update Interrupt source
  *            @arg TIM_IT_CC1_MORT: TIM Capture Compare 1 Interrupt source
  *            @arg TIM_IT_CC2_MORT: TIM Capture Compare 2 Interrupt source
  *            @arg TIM_IT_CC3_MORT: TIM Capture Compare 3 Interrupt source
  *            @arg TIM_IT_CC4_MORT: TIM Capture Compare 4 Interrupt source
  *            @arg TIM_IT_COM_MORT: TIM Commutation Interrupt source
  *            @arg TIM_IT_Trigger_MORT: TIM Trigger Interrupt source
  *            @arg TIM_IT_Break_MORT: TIM Break Interrupt source
  *
  * @note   TIM6_MORT and TIM7_MORT can generate only an update interrupt.
  * @note   TIM_IT_COM_MORT and TIM_IT_Break_MORT are used only with TIM1_MORT and TIM8_MORT.
  *      
  * @retval None
  */
void TIM_ClearITPendingBit_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_IT)
{
  /* Check the parameters */
  assert_param(IS_TIM_ALL_PERIPH_MORT(TIMx));

  /* Clear the IT pending Bit */
  TIMx->SR = (uint16_t)~TIM_IT;
}

/**
  * @brief  Configures the TIMx's DMA interface.
  * @param  TIMx: where x can be 1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
  * @param  TIM_DMABase: DMA Base address.
  *          This parameter can be one of the following values:
  *            @arg TIM_DMABase_CR1_MORT  
  *            @arg TIM_DMABase_CR2_MORT
  *            @arg TIM_DMABase_SMCR_MORT
  *            @arg TIM_DMABase_DIER_MORT
  *            @arg TIM1_DMABase_SR
  *            @arg TIM_DMABase_EGR_MORT
  *            @arg TIM_DMABase_CCMR1_MORT
  *            @arg TIM_DMABase_CCMR2_MORT
  *            @arg TIM_DMABase_CCER_MORT
  *            @arg TIM_DMABase_CNT_MORT   
  *            @arg TIM_DMABase_PSC_MORT   
  *            @arg TIM_DMABase_ARR
  *            @arg TIM_DMABase_RCR_MORT
  *            @arg TIM_DMABase_CCR1_MORT
  *            @arg TIM_DMABase_CCR2_MORT
  *            @arg TIM_DMABase_CCR3_MORT  
  *            @arg TIM_DMABase_CCR4_MORT
  *            @arg TIM_DMABase_BDTR_MORT
  *            @arg TIM_DMABase_DCR_MORT
  * @param  TIM_DMABurstLength: DMA Burst length. This parameter can be one value
  *         between: TIM_DMABurstLength_1Transfer_MORT and TIM_DMABurstLength_18Transfers_MORT.
  * @retval None
  */
void TIM_DMAConfig_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_DMABase, uint16_t TIM_DMABurstLength)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST3_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_DMA_BASE_MORT(TIM_DMABase)); 
  assert_param(IS_TIM_DMA_LENGTH_MORT(TIM_DMABurstLength));

  /* Set the DMA Base and the DMA Burst Length */
  TIMx->DCR = TIM_DMABase | TIM_DMABurstLength;
}

/**
  * @brief  Enables or disables the TIMx's DMA Requests.
  * @param  TIMx: where x can be 1, 2, 3, 4, 5, 6, 7 or 8 to select the TIM peripheral.
  * @param  TIM_DMASource: specifies the DMA Request sources.
  *          This parameter can be any combination of the following values:
  *            @arg TIM_DMA_Update_MORT: TIM update Interrupt source
  *            @arg TIM_DMA_CC1_MORT: TIM Capture Compare 1 DMA source
  *            @arg TIM_DMA_CC2_MORT: TIM Capture Compare 2 DMA source
  *            @arg TIM_DMA_CC3_MORT: TIM Capture Compare 3 DMA source
  *            @arg TIM_DMA_CC4_MORT: TIM Capture Compare 4 DMA source
  *            @arg TIM_DMA_COM_MORT: TIM Commutation DMA source
  *            @arg TIM_DMA_Trigger_MORT: TIM Trigger DMA source
  * @param  NewState: new state of the DMA Request sources.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TIM_DMACmd_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_DMASource, FunctionalState NewState)
{ 
  /* Check the parameters */
  assert_param(IS_TIM_LIST5_PERIPH_MORT(TIMx)); 
  assert_param(IS_TIM_DMA_SOURCE_MORT(TIM_DMASource));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the DMA sources */
    TIMx->DIER |= TIM_DMASource; 
  }
  else
  {
    /* Disable the DMA sources */
    TIMx->DIER &= (uint16_t)~TIM_DMASource;
  }
}

/**
  * @brief  Selects the TIMx peripheral Capture Compare DMA source.
  * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
  * @param  NewState: new state of the Capture Compare DMA source
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TIM_SelectCCDMA_mort(TIM_TypeDef_mort* TIMx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST3_PERIPH_MORT(TIMx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CCDS Bit */
    TIMx->CR2 |= TIM_CR2_CCDS_MORT;
  }
  else
  {
    /* Reset the CCDS Bit */
    TIMx->CR2 &= (uint16_t)~TIM_CR2_CCDS_MORT;
  }
}
/**
  * @}
  */

/** @defgroup TIM_Group6 Clocks management functions
 *  @brief    Clocks management functions
 *
@verbatim   
 ===============================================================================
                  ##### Clocks management functions #####
 ===============================================================================  

@endverbatim
  * @{
  */

/**
  * @brief  Configures the TIMx internal Clock
  * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
  *         peripheral.
  * @retval None
  */
void TIM_InternalClockConfig_mort(TIM_TypeDef_mort* TIMx)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST2_PERIPH_MORT(TIMx));

  /* Disable slave mode to clock the prescaler directly with the internal clock */
  TIMx->SMCR &=  (uint16_t)~TIM_SMCR_SMS_MORT;
}

/**
  * @brief  Configures the TIMx Internal Trigger as External Clock
  * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9 or 12 to select the TIM 
  *         peripheral.
  * @param  TIM_InputTriggerSource: Trigger source.
  *          This parameter can be one of the following values:
  *            @arg TIM_TS_ITR0_MORT: Internal Trigger 0
  *            @arg TIM_TS_ITR1_MORT: Internal Trigger 1
  *            @arg TIM_TS_ITR2_MORT: Internal Trigger 2
  *            @arg TIM_TS_ITR3_MORT: Internal Trigger 3
  * @retval None
  */
void TIM_ITRxExternalClockConfig_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_InputTriggerSource)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST2_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_INTERNAL_TRIGGER_SELECTION_MORT(TIM_InputTriggerSource));

