w3ichen/haptic-hand/stm32f4xx_tim_mort.c
  /* Select the Internal Trigger */
  TIM_SelectInputTrigger_mort(TIMx, TIM_InputTriggerSource);

  /* Select the External clock mode1 */
  TIMx->SMCR |= TIM_SlaveMode_External1_MORT;
}

/**
  * @brief  Configures the TIMx Trigger as External Clock
  * @param  TIMx: where x can be 1, 2, 3, 4, 5, 8, 9, 10, 11, 12, 13 or 14  
  *         to select the TIM peripheral.
  * @param  TIM_TIxExternalCLKSource: Trigger source.
  *          This parameter can be one of the following values:
  *            @arg TIM_TIxExternalCLK1Source_TI1ED_MORT: TI1 Edge Detector
  *            @arg TIM_TIxExternalCLK1Source_TI1_MORT: Filtered Timer Input 1
  *            @arg TIM_TIxExternalCLK1Source_TI2_MORT: Filtered Timer Input 2
  * @param  TIM_ICPolarity: specifies the TIx Polarity.
  *          This parameter can be one of the following values:
  *            @arg TIM_ICPolarity_Rising_MORT
  *            @arg TIM_ICPolarity_Falling_MORT
  * @param  ICFilter: specifies the filter value.
  *          This parameter must be a value between 0x0 and 0xF.
  * @retval None
  */
void TIM_TIxExternalClockConfig(TIM_TypeDef_mort* TIMx, uint16_t TIM_TIxExternalCLKSource,
                                uint16_t TIM_ICPolarity, uint16_t ICFilter)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST1_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_IC_POLARITY(TIM_ICPolarity));
  assert_param(IS_TIM_IC_FILTER_MORT(ICFilter));

  /* Configure the Timer Input Clock Source */
  if (TIM_TIxExternalCLKSource == TIM_TIxExternalCLK1Source_TI2_MORT)
  {
    TI2_Config_mort(TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI_MORT, ICFilter);
  }
  else
  {
    TI1_Config_mort(TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI_MORT, ICFilter);
  }
  /* Select the Trigger source */
  TIM_SelectInputTrigger_mort(TIMx, TIM_TIxExternalCLKSource);
  /* Select the External clock mode1 */
  TIMx->SMCR |= TIM_SlaveMode_External1_MORT;
}

/**
  * @brief  Configures the External clock Mode1
  * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
  * @param  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
  *          This parameter can be one of the following values:
  *            @arg TIM_ExtTRGPSC_OFF_MORT: ETRP Prescaler OFF.
  *            @arg TIM_ExtTRGPSC_DIV2_MORT: ETRP frequency divided by 2.
  *            @arg TIM_ExtTRGPSC_DIV4_MORT: ETRP frequency divided by 4.
  *            @arg TIM_ExtTRGPSC_DIV8_MORT: ETRP frequency divided by 8.
  * @param  TIM_ExtTRGPolarity: The external Trigger Polarity.
  *          This parameter can be one of the following values:
  *            @arg TIM_ExtTRGPolarity_Inverted_MORT: active low or falling edge active.
  *            @arg TIM_ExtTRGPolarity_NonInverted_MORT: active high or rising edge active.
  * @param  ExtTRGFilter: External Trigger Filter.
  *          This parameter must be a value between 0x00 and 0x0F
  * @retval None
  */
void TIM_ETRClockMode1Config_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_ExtTRGPrescaler,
                            uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter)
{
  uint16_t tmpsmcr = 0;

  /* Check the parameters */
  assert_param(IS_TIM_LIST3_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_EXT_PRESCALER_MORT(TIM_ExtTRGPrescaler));
  assert_param(IS_TIM_EXT_POLARITY_MORT(TIM_ExtTRGPolarity));
  assert_param(IS_TIM_EXT_FILTER_MORT(ExtTRGFilter));
  /* Configure the ETR Clock source */
  TIM_ETRConfig_mort(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);
  
  /* Get the TIMx SMCR register value */
  tmpsmcr = TIMx->SMCR;

  /* Reset the SMS Bits */
  tmpsmcr &= (uint16_t)~TIM_SMCR_SMS_MORT;

  /* Select the External clock mode1 */
  tmpsmcr |= TIM_SlaveMode_External1_MORT;

  /* Select the Trigger selection : ETRF */
  tmpsmcr &= (uint16_t)~TIM_SMCR_TS_MORT;
  tmpsmcr |= TIM_TS_ETRF_MORT;

  /* Write to TIMx SMCR */
  TIMx->SMCR = tmpsmcr;
}

/**
  * @brief  Configures the External clock Mode2
  * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
  * @param  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
  *          This parameter can be one of the following values:
  *            @arg TIM_ExtTRGPSC_OFF_MORT: ETRP Prescaler OFF.
  *            @arg TIM_ExtTRGPSC_DIV2_MORT: ETRP frequency divided by 2.
  *            @arg TIM_ExtTRGPSC_DIV4_MORT: ETRP frequency divided by 4.
  *            @arg TIM_ExtTRGPSC_DIV8_MORT: ETRP frequency divided by 8.
  * @param  TIM_ExtTRGPolarity: The external Trigger Polarity.
  *          This parameter can be one of the following values:
  *            @arg TIM_ExtTRGPolarity_Inverted_MORT: active low or falling edge active.
  *            @arg TIM_ExtTRGPolarity_NonInverted_MORT: active high or rising edge active.
  * @param  ExtTRGFilter: External Trigger Filter.
  *          This parameter must be a value between 0x00 and 0x0F
  * @retval None
  */
void TIM_ETRClockMode2Config_mort(TIM_TypeDef_mort* TIMx, uint16_t TIM_ExtTRGPrescaler, 
                             uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter)
{
  /* Check the parameters */
  assert_param(IS_TIM_LIST3_PERIPH_MORT(TIMx));
  assert_param(IS_TIM_EXT_PRESCALER_MORT(TIM_ExtTRGPrescaler));
  assert_param(IS_TIM_EXT_POLARITY_MORT(TIM_ExtTRGPolarity));
  assert_param(IS_TIM_EXT_FILTER_MORT(ExtTRGFilter));

  /* Configure the ETR Clock source */
  TIM_ETRConfig_mort(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);

  /* Enable the External clock mode2 */
  TIMx->SMCR |= TIM_SMCR_ECE_MORT;
}
/**
  * @}
  */

/** @defgroup TIM_Group7 Synchronization management functions
 *  @brief    Synchronization management functions 
 *
@verbatim   
 ===============================================================================
                ##### Synchronization management functions #####
 ===============================================================================  
                         
          ##### TIM Driver: how to use it in synchronization Mode #####
 ===============================================================================
    [..] 
    
